while True:
 print("==โปรแกรมคำนวณค่าไฟฟ้า==")
 print("1.คำนวณค่าไฟฟ้า")
 print("2.ออกจากโปรแกรม")

 choice = int(input("เลือกเมนู :"))
calculate(unit):
        if unit < 0:
            print("จำนวนค่าไฟต้องไม่ติดลบ")
        if unit > 100:
            cost = (50*2.50)+(50*3.00)+(unit-100)*3.50+25
            print("รายละเอียดหน่วยค่าไฟ")
            print("1-50 หน่วย :125.00บาท")
            print("51-100 หน่วย :150บาท")
            print("100 หน่วย :70บาท")
            print("ค่าบริการ 25 บาท")
            print(f"รวมค่าไฟ {cost}")
        elif unit > 50:
            cost = (50*2.50)+(unit-50)*3.0+25
            print("รายละเอียดหน่วยค่าไฟ")
            print("1-50 หน่วย :125.00บาท")
            print("51-100 หน่วย :150บาท")
            print("100 หน่วย :70บาท")
            print("ค่าบริการ 25 บาท")
            print(f"รวมค่าไฟ {cost}")
        elif unit > 0:
            cost = (unit*2.50)+25.0
            print("รายละเอียดหน่วยค่าไฟ")
            print("1-50 หน่วย :125.00บาท")
            print("51-100 หน่วย :150บาท")
            print("100 หน่วย :70บาท")
            print("ค่าบริการ 25 บาท")
            print(f"รวมค่าไฟ {cost}")

if choice == 1 :
unit  = int(input("กรอกจำนวนหน่วยค่าไฟ"))
elif choice == 2:
print("ออกจากโปรแกรม")
 break



